      ******************************************************************
      * Author: Clair Marchesani
      * Date: 14 May 2016
      * Purpose: Self-Study / Demonstration
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXPRESSION-SOLVER.
       AUTHOR CLAIR MARCHESANI.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY "Expression solver not yet complete, sorry!"
           STOP RUN.
       END PROGRAM EXPRESSION-SOLVER.
